cfd/OpenFOAM/incompressible/simpleFoam/xx_tetMesh/system/meshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v22v230606                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// ************************************************************************* //

surfaceFile "surfaceMeshes/geometry.fms";


minCellSize 0.25;
maxCellSize 0.25;

localRefinement
{
    "model"
    {
        cellSize 0.05;
    }
}

boundaryLayers
{
    nLayers 3;
    thicknessRatio 1.1;
    maxFirstLayerThickness 0.005;
    allowDiscontinuity 0;
}


renameBoundary
{
    defaultType patch;
    
    newPatchNames
    {
        inlet
        {
            type    patch;
            newName inlet;
        }
        
        outlet
        {
            type    patch;
            newName outlet;
        }
        
        freestream
        {
            type    patch;
            newName freestream;
        }
        
        model
        {
            type    wall;
            newName model;
        }
    }
}

// ************************************************************************* //
